Repository: Codra-Ingenierie-Informatique/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/general/remotecontrol.po
Languages: fr

source: Remote controlling
fr: Contrôle à distance

source: DataLab may be controlled remotely using the `XML-RPC`_ protocol which is natively supported by Python. Remote controlling allows to access DataLab main features from a separate process.
fr: DataLab peut être contrôlé à distance grâce au protocole `XML-RPC`_ qui est nativement pris en charge par Python. Le pilotage à distance permet d'accéder aux fonctionnalités principales de DataLab depuis un processus séparé.

source: From an IDE
fr: Depuis un IDE

source: It is possible to run a Python script from an IDE (e.g. `Spyder`_ or any other IDE, or even a Jupyter Notebook) that connects to a running DataLab instance, adds a signal and an image, and then runs calculations. This is the case of the `RemoteClient` class that is provided in module ``cdl.remote``.
fr: Il est possible d'exécuter un script Python depuis un IDE (par exemple `Spyder`_ ou tout autre IDE, ou même un Jupyter Notebook) qui se connecte à une instance de DataLab en cours d'exécution, ajoute un signal et une image, puis exécute des calculs. C'est le cas de la classe `RemoteClient` qui est fournie dans le module ``cdl.remote``.

source: From a third-party application
fr: Depuis une application tierce

source: It is also possible to connect to a running DataLab instance from a third-party application, adds a signal and an image, and then runs calculations. This is the case of the `RemoteClient` class that is provided in module ``cdl.remote``.
fr: Il est également possible de se connecter à une instance de DataLab en cours d'exécution depuis une application tierce, d'ajouter un signal et une image, puis d'exécuter des calculs. C'est le cas de la classe `RemoteClient` qui est fournie dans le module ``cdl.remote``.

source: Data (signals and images) may also be exchanged between DataLab and the remote client application, in both directions.
fr: Les données (signaux et images) peuvent également être échangées entre DataLab et l'application cliente distante, dans les deux sens.

source: The remote client application may be written in any language that supports XML-RPC. For example, it is possible to write a remote client application in Python, Java, C++, C#, etc. The remote client application may be a graphical application or a command line application.
fr: Le client distant peut être écrit dans n'importe quel langage qui prend en charge XML-RPC. Par exemple, il est possible d'écrire un client distant en Python, Java, C++, C#, etc. Le client distant peut être une application graphique ou une application en ligne de commande.

source: The remote client application may be run on the same computer as DataLab or on a different computer. In the latter case, the remote client application must know the IP address of the computer running DataLab.
fr: Le client distant peut être exécuté sur le même ordinateur que DataLab ou sur un ordinateur différent. Dans ce dernier cas, le client distant doit connaître l'adresse IP de l'ordinateur exécutant DataLab.

source: The remote client application may be run before or after DataLab. In the latter case, the remote client application must try to connect to DataLab until it succeeds.
fr: Le client distant peut être exécuté avant ou après DataLab. Dans ce dernier cas, le client distant doit essayer de se connecter à DataLab jusqu'à ce qu'il réussisse.

source: Supported features
fr: Fonctionnalités prises en charge

source: Supported features are the following:
fr: Les fonctionnalités prises en charge sont les suivantes :

source: Switch to signal or image panel
fr: Basculement vers le panneau signal ou image

source: Remove all signals and images
fr: Suppression de tous les signaux et images

source: Save current session to a HDF5 file
fr: Enregistrement de la session en cours dans un fichier HDF5

source: Open HDF5 files into current session
fr: Ouverture de fichers HDF5 dans la session en cours

source: Browse HDF5 file
fr: Exploration d'un fichier HDF5

source: Open a signal or an image from file
fr: Ouverture d'un signal ou d'une image depuis un fichier

source: Add a signal
fr: Ajout d'un signal

source: Add an image
fr: Ajout d'une image

source: Get object list
fr: Récupération de la liste des objets

source: Run calculation with parameters
fr: Exécution d'un calcul avec des paramètres

source: Some examples are provided to help implementing such a communication between your application and DataLab:
fr: Des exemples d'utilisation du contrôle à distance sont fournis afin d'aider à l'implémentation de la communication entre votre application et DataLab :

source: See module: ``cdl.tests.remoteclient_app``
fr: Voir le module ``cdl.tests.remoteclient_app``

source: See module: ``cdl.tests.remoteclient_unit``
fr: Voir le module ``cdl.tests.remoteclient_unit``

source: Screenshot of remote client application test (``cdl.tests.remoteclient_app``)
fr: Copie d'écran du test applicatif du contrôle à distance (``cdl.tests.remoteclient_app``)

source: When using Python 3, you may directly use the `RemoteClient` class as in examples cited above.
fr: Avec Python 3, il est possible d'utiliser directement la classe `RemoteClient` comme dans les exemples précités.

source: Here is an example in Python 3 of a script that connects to a running DataLab instance, adds a signal and an image, and then runs calculations (the cell structure of the script make it convenient to be used in `Spyder`_ IDE):
fr: Voici un exemple d'un script en Python 3 qui se connecte à une instance de DataLab, ajoute un signal et une image, puis exécute des calculs (la structure en cellules du script le rend pratique à utiliser dans l'IDE `Spyder`_):

source: Here is a Python 2.7 reimplementation of this class:
fr: Voici de plus un exemple de réimplementation de cette classe en Python 2.7 :
